<template>
  <div class="contacts">
    <div class="head">
      <h1 class="display-6 title">Оплата, доставка, монтаж</h1>
      <span>Владимир, Владимирская область</span>
    </div>
    <div v-for="(content, i) in contents">
      <h4>{{ content.title }}</h4>
      <p class="lead" v-if="!Array.isArray(content.text)">
        {{ content.text }}
      </p>
      <p class="lead" v-for="text in content.text" v-else-if="content.text">
        {{ text }}
      </p>
      <div v-if="content.lists">
        <ul class="list-group list-group-flush">
          <li v-for="list in content.lists" class="list-group-item">
            {{ list }}
          </li>
        </ul>
      </div>
      <hr v-if="i + 1 !== contents.length" />
    </div>
  </div>
</template>

<script setup lang="ts">
const contents = [
  {
    title: "Оплата",
    lists: [
      `При оформлении заказа оплачивается сперва предоплата 10% от стоимости
        заказа, остальная оплата заказа производится по факту доставки, осмотра
        и проверок изделия заказчиком.`,
      `При заказе от 50000 рублей вносится предоплата 50% от стоимости изделий
        в заказе.`,
    ],
  },
  {
    title: "Доставка",
    lists: [
      `Доставка зеркал и аксессуаров в пределах города Владимира от 600р при
        заказе от 50000 рублей осуществляется бесплатно.`,
      `При доставке за город, рассчитывается 24р за километр.`,
      `Срок доставки – 1, 2 рабочих дня с момента готовности зеркал.`,
      `Гарантия целостности товара 100%`,
      `При отсутствии в здании лифта (а так же при любых его неисправностях и
        малых габаритах) доставка производится до первого этажа.`,
      `При ручном подъеме изделия (по желанию клиента) цена на данную услугу
        составляет 200 рублей за этаж.`,
    ],
  },
  {
    title: "Монтаж",
    lists: [
      `Стоимость монтажа всех зеркал, которые имеют раму или корпус (навесные)
        составляет 20% от цены изделия, но не менее 900р за изделие.`,
      `Стоимость монтажа зеркальных панно и обычных зеркальных полотен
        составляет 30% от цены изделия.`,
      `Минимальная стоимость монтажа изделия под вклейку составляет 1500р.`,
      `Стоимость монтажа стеклянных полок составляет минимально 1100 рублей за
        полку.`,
    ],
  },
  {
    title: "Самовывоз",
    text: `Вы можете бесплатно забрать ваше зеркало после его изготовления в пункте самовывоза по адресу: город Владимир , ул. Северная 1а , корпус 32.`,
  },
];
</script>

<style lang="scss" scoped src="../styles/delivery.scss"></style>
