export function Main() {
  return (
    <>
      <div className="main">
        <h1 className="display-6">Главная страница приложения Monitoring</h1>
        <hr />
        <p className="lead">
          Приложение <strong>Monitoring</strong> предназначено для управления
          группами и пользователями, а также для распределения задач между
          участниками групп. Пользователи могут создавать группы, добавлять
          участников и назначать им задания. Задания проходят несколько стадий,
          что позволяет отслеживать их прогресс. Приложение поддерживает
          различные форматы выгрузки заданий, а также фильтры для удобной
          сортировки и поиска нужной информации. Это многофункциональное решение
          для командной работы и управления проектами.
        </p>
        <br />
      </div>
    </>
  );
}
